app/Controllers/Panel/Generos.php

SELECT *
FROM `generos`
---
    private function load_data()
    {
        helper('message');

        $data = array();
        $data['nombre_pagnia'] = 'Géneros';
        $data['titulo_pagina'] = 'Gestión de Géneros';

        $data["nombre_completo_usuario"] = $this->session->nombre_completo;
        $data["nombre_usuario"] = $this->session->nickname;
        $data["email_usuario"] = $this->session->correo;
        $data["imagen_usuario"] = ($this->session->perfil == NULL)
            ? (($this->session->sexo == MASCULINO) ? 'HOMBRE.jpeg' : 'MUJER.jpeg')
            : $this->session->perfil;

        $breadcrumb = array(
            array(
                'href' => route_to("generos"),
                'titulo' => 'Géneros',
            ),
            array(
                'href' => '#',
                'titulo' => 'Gestión de Géneros',
            )
        );
        $data['breadcrumb_panel'] = breadcrumb_panel($data['titulo_pagina'], $breadcrumb);

        // Aquí puedes llamar al modelo para obtener los géneros si ya lo tienes
        $tabla_generos = new \App\Models\Tabla_Generos();
        $data["generos"] = $tabla_generos->findAll();