app/Models/Tabla_Generos.php

INSERT INTO `generos` (`estatus_genero`, `nombre_genero`, `descripcion_genero`) VALUES (1, 'Trap1212', 'saqsas')
---
    public function create($data = [])
    {
        return $this->insert($data);