app/Models/Tabla_Pagos.php

SELECT `pagos`.*, `usuarios`.`nombre_usuario`, `usuarios`.`ap_usuario`, `usuarios`.`am_usuario`, `planes`.`nombre_plan`, `planes`.`precio_plan`
FROM `pagos`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `pagos`.`id_usuario`
JOIN `planes` ON `planes`.`id_plan` = `pagos`.`id_plan`
---
    public function getWithRelations()
    {
        return $this->select('
                pagos.*,
                usuarios.nombre_usuario,
                usuarios.ap_usuario,
                usuarios.am_usuario,
                planes.nombre_plan,
                planes.precio_plan
            ')
            ->join('usuarios', 'usuarios.id_usuario = pagos.id_usuario')
            ->join('planes', 'planes.id_plan = pagos.id_plan')
            ->findAll();